tap "atombender/ktail"
brew "atombender/ktail/ktail"

brew "hashicorp/tap/vault"
brew "chainguard-dev/tap/chainctl"
brew "aquasecurity/trivy/trivy"

brew "act"

brew "zsh-autosuggestions"

brew "colima"
brew "docker"

brew "dockutil"

# GNU Core Utils
brew "coreutils"
brew "autoconf"
brew "bash"
brew "binutils"
brew "diffutils"
brew "ed"
brew "findutils"
brew "flex"
brew "gawk"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "gpatch"
brew "grep"
brew "gzip"
brew "less"
brew "m4"
brew "make"
brew "nano"
brew "screen"
brew "watch"
brew "wdiff"
brew "wget"
brew "zip"

# Runtimes
brew "python"
brew "go"
brew "git"
brew "gh"
brew "helm"
brew "kubectx"
brew "terraform"
brew "krew"
brew "jenv"
brew "java"
brew "yarn"

# Code Signing
brew "gpg2"
brew "gnupg"
brew "pinentry-mac"

brew "keka"
brew "gifski"
brew "azure-cli"

brew "grype"

brew "krew"

cask "azure-data-studio"
cask "chromium"
cask "clocker"
cask "discord"
cask "drawio"
cask "google-chrome"
cask "insomnia"
cask "iterm2"
cask "keepassxc"
cask "keepingyouawake"
cask "keka"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-teams"
cask "mockoon"
cask "postman"
cask "powershell"
cask "rectangle"
cask "trunk-io"
cask "visual-studio-code"
cask "zoom"

vscode "4ops.terraform"
vscode "adamhartford.vscode-base64"
vscode "adriansanguineti.json-parse-validator"
vscode "davidanson.vscode-markdownlint"
vscode "esbenp.prettier-vscode"
vscode "exiasr.hadolint"
vscode "formulahendry.github-actions"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "humao.rest-client"
vscode "jflbr.jwt-decoder"
vscode "lostintangent.github-security-alerts"
vscode "mariusalchimavicius.json-to-ts"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-sarifvscode.sarif-viewer"
vscode "omartawfik.github-actions-vscode"
vscode "orta.vscode-jest"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "trunk.io"
vscode "vscodeshift.mui-snippets"
vscode "waderyan.gitblame"
vscode "wdhongtw.gpg-indicator"
vscode "rosshamish.kuskus-kusto-language-server"
