tap "atombender/ktail"
brew "atombender/ktail/ktail"

brew "hashicorp/tap/vault"
brew "chainguard-dev/tap/chainctl"
brew "aquasecurity/trivy/trivy"

brew "act"

brew "asdf"

brew "colima"
brew "docker"

brew "dockutil"

# GNU Core Utils
brew "coreutils"
brew "autoconf"
brew "bash"
brew "binutils"
brew "diffutils"
brew "ed"
brew "findutils"
brew "flex"
brew "gawk"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "gpatch"
brew "grep"
brew "gzip"
brew "less"
brew "m4"
brew "make"
brew "nano"
brew "screen"
brew "watch"
brew "wdiff"
brew "wget"
brew "zip"

# Code Signing
brew "gpg2"
brew "gnupg"
brew "pinentry-mac"

brew "keka"
brew "gifski"
brew "azure-cli"

# cat replacement
brew "bat"
# ls replacement
brew "exa"
# ping graph
brew "gping"

cask "iterm2"
cask "keepassxc"
cask "insomnia"
cask "drawio"
cask "visual-studio-code"
cask "microsoft-edge"
cask "chromium"
cask "slack"
cask "discord"
cask "k9s"
cask "zoom"
cask "clocker"
cask "keepingyouawake"
cask "mockoon"
cask "azure-data-studio"
cask "rectangle"
cask "tableplus"
cask "kubecontext"

vscode "4ops.terraform"
vscode "adamhartford.vscode-base64"
vscode "adriansanguineti.json-parse-validator"
vscode "betajob.modulestf"
vscode "davidanson.vscode-markdownlint"
vscode "docsmsft.docs-yaml"
vscode "esbenp.prettier-vscode"
vscode "exiasr.hadolint"
vscode "formulahendry.github-actions"
vscode "foxundermoon.shell-format"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "humao.rest-client"
vscode "infeng.vscode-react-typescript"
vscode "jflbr.jwt-decoder"
vscode "lostintangent.github-security-alerts"
vscode "mariusalchimavicius.json-to-ts"
vscode "matangover.mypy"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.powershell"
vscode "ms-vsliveshare.vsliveshare"
vscode "njpwerner.autodocstring"
vscode "omartawfik.github-actions-vscode"
vscode "orta.vscode-jest"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "samuelcharpentier.remove-non-ascii-chars"
vscode "sonarsource.sonarlint-vscode"
vscode "synopsyscodesight.vscode-codesight"
vscode "trunk.io"
vscode "vscodeshift.mui-snippets"
vscode "waderyan.gitblame"
vscode "wdhongtw.gpg-indicator"
vscode "zhuangtongfa.material-theme"